ltcmweb/seedsigner-micropython-builder/ports/esp32/board_common/boards/waveshare_p4_lcd43/sdkconfig.defaults
# Waveshare ESP32-P4 WiFi6 Touch LCD 4.3
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# L2 cache sizing for MIPI-DSI frame buffers in PSRAM
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# FreeRTOS tick rate (needed for smooth LVGL rendering)
CONFIG_FREERTOS_HZ=1000

# Main task stack (MIPI-DSI init is deeper than SPI)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Required for some ESP32-P4 peripheral features
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Disable power management (avoids clock gating issues with display)
CONFIG_PM_ENABLE=n

# Console: primary on UART0 (ESP-IDF default).
# Secondary on USB Serial JTAG — non-blocking output on /dev/ttyACM0
# when a host is connected. Does not replace UART0 as the primary console.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
